[
  {
    "image": "/pev_1.jpg",
    "title": "Our exciting new event organised and co-hosted by Beta Alpha Psi Swinburne Charter!",
    "description": "Step into the future with David J Banger, the Founder of CHANGE lead®, as he takes you on a journey to the year 2030. In this immersive masterclass, we'll explore the landscape where technology reigns supreme, driving significant shifts across industries worldwide. From the convergence of artificial intelligence, data analytics, and connectivity to the revolutionizing effects of 5G connectivity and edge computing, we'll delve into how these advancements are reshaping our personal and professional spheres.",
    "date": "2024-04-23T08:00:00.000Z",
    "link": "https://www.instagram.com/p/C553MorSE6b/?hl=en",
    "venue": "AMDC 501"
  },
  {
    "image": "/pev_2.jpg",
    "title": "Enterprenurship Social Night",
    "description": "Kick off the rest of semester with some games, free food and networking with like minded people",
    "date": "2024-04-04T06:30:00.000Z",
    "link": "https://www.instagram.com/p/C5Dk9JoSUak/?hl=en",
    "venue": "The Node"
  },
  {
    "image": "/pev_3.jpg",
    "title": "Networking For Success",
    "description": "Join us for an extraordinary evening as we welcome @jahintanvir, 3-time TEDx speaker and CEO of the Australian School of Entrepreneurship who will enlighten us on the art of networking. 🤝 Prepare to discover the secrets to building meaningful connections and propelling your success to new heights! 🚀 Don’t miss this opportunity to learn from a true networking master",
    "date": "2023-09-25T07:30:00.000Z",
    "link": "https://www.instagram.com/p/CxXe9uDOrpK/?hl=en&img_index=1",
    "venue": ""
  },
  {
    "image": "/pev_4.jpg",
    "title": "Movie Night",
    "description": "Join us for an exciting Movie Night on May 3rd! Come along for a relaxing social event with a film that will inspire and entertain. Whether you’re a movie buff, a finance enthusiast, enthusiastic entrepreneur or just looking for a fun evening, this event is for you!",
    "date": "2023-05-03T08:30:00.000Z",
    "link": "https://www.instagram.com/p/C6GIzmrOpYZ/?hl=en",
    "venue": "BA302"
  },
  {
    "image": "/pev_5.jpg",
    "title": "Movie Night",
    "description": "🍔Bring your lunch, kick back in the cool comfort of the AGSE 102, and let’s mingle. It’s all about getting to know each other, sharing some laughs, and easing into the semester.",
    "date": "2024-03-01T01:00:00.000Z",
    "link": "https://www.instagram.com/p/C31mVC3yDTl/?hl=en",
    "venue": "AGSE 102"
  },
  {
    "image": "/pev_6.jpg",
    "title": "Learning from Enterpreneurs with Dom Pym",
    "description": "Join us on 24th August 2023 for an inspiring evening with Dom Pym, the visionary co-founder of Up Bank, Pin Payments, and Ferocia.",
    "date": "2024-08-24T07:00:00.000Z",
    "link": "https://www.instagram.com/p/Cvm2AsdSxGQ/?hl=en",
    "venue": "AGSE 202"
  },
  {
    "image": "/pev_7.jpg",
    "title": "Fireside Chat with Arjun",
    "description": "Hey entrepreneurs and future founders! 🎉 Are you interested in building a successful business while making a positive impact on society? Then you dont want to miss our fireside chat with Arjun Agarwal co-founder of @inaam_yourmoney & @maslowau - two companies that are disrupting the fintech scene in Australia. Arjun will be sharing his incredible journey as an entrepreneur and how he built businesses that combine profit with purpose. Plus, you’ll have plenty of opportunities to network with other awesome people, indulge in some delicious food, and gain valuable insights from the event.Hosted by the inspirational Dr Dimitrios Salampasis, Senior Lecturer of FinTech Innovation & Entrepreneurship at Swinburne University, this event promises to be an unforgettable experience!",
    "date": "2023-03-09T06:00:00.000Z",
    "link": "https://www.instagram.com/p/CpMT0Y_SwA4/?hl=en",
    "venue": "AGSE 202"
  },
  {
    "image": "/pev_8.jpg",
    "title": "Building a Business in an Hour.....With no Code",
    "description": "Have an idea that you would like to bring to life, but don't know how to code? Well, you don't have to be a coder to be a successful entrepreneur! Come to this live building session presented by entrepreneur @thedannyferg and you will walk away with the knowledge and tools needed to build your own business. The workshop will be followed by a session of networking and Pizzas. Registration link in bio.",
    "date": "2022-08-06T07:00:00.000Z",
    "link": "https://www.instagram.com/p/CpMT0Y_SwA4/?hl=en",
    "venue": ""
  },
  {
    "image": "/pev_9.jpg",
    "title": "Concept with Production",
    "description": "Have a startup idea but don't know where to start and how to bring it to life? Then this workshop is for you. The workshop will be delivered by Social entrepreneur, Daniel Ferguson (Founder and President of the Helping Group Organisation, Cofounder - @swinlead) who will be going over the high level steps of taking a startup idea from concept to production. The workshop will be followed by a networking session and some refreshments.",
    "date": "2022-05-02T07:00:00.000Z",
    "link": "https://www.instagram.com/p/Ccx2x-uv3j0/?hl=en",
    "venue": ""
  },
  {
    "image": "/pev_10.jpg",
    "title": "SEC X SPC Trivia Night",
    "description": "We are super excited to announce our first event of 2022, a trivia night in collaboration with the amazing Swinburne Physics Club What - Trivia NightWhen - Wednesday 9th of March 2022 from 5:00 pm onwards (trivia starts at 5:45 pm)Where - Hammer and Swine. In teams of 3 or 4, rack your brains to tackle a large range of questions and see if you can come out on top. Don't worry if you don't know anyone yet. Come on in and we will assign you a team. Meet other students, get to know the campus bar and test your knowledge in a range of different topics. Will you be the Trivia Champion? Only one way to find out. Register Now - Link in bio",
    "date": "2022-03-08T06:00:00.000Z",
    "link": "https://www.instagram.com/p/Ca0o6lMvULt/?hl=en",
    "venue": "Hammer and Swine"
  },
  {
    "image": "/pev_11.jpg",
    "title": "AGM + Games Night",
    "description": "Swinburne Entrepreneurship club will be hosting its AGM on the 30th of October 2021 at 7 pm AEST! Come vote and win prizes. Club committee positions on offer are President, Secretary, Treasurer and Events Lead. All relevant links can be accessed from the bio",
    "date": "2021-10-30T08:00:00.000Z",
    "link": "https://www.instagram.com/p/Ca0o6lMvULt/?hl=en",
    "venue": "Hammer and Swine"
  },
  {
    "image": "/pev_12.jpg",
    "title": "Meet and Greet",
    "description": "Get to know each other well!",
    "date": "2021-09-18T08:00:00.000Z",
    "link": "https://www.instagram.com/p/CTeScGYBUt1/?hl=en",
    "venue": ""
  }
]
